# kube-prometheus-stack

## 참고 
- https://faun.pub/kube-prometheus-with-terraform-and-helm-24cac706fbdb
- values: https://github.com/prometheus-community/helm-charts/blob/main/charts/kube-prometheus-stack/values.yaml


## 오류: Node 부족

Node 부족으로 인한 문제 발생
- Node 개수 증가로 해결

```tf
resource "helm_release" "kube-prometheus" {
  chart      = "kube-prometheus-stack"
  name       = "prometheus"
  namespace  = "monitoring"
  repository = "https://prometheus-community.github.io/helm-charts"
}
```
```shelll
  # helm_release.kube-prometheus will be created
  + resource "helm_release" "kube-prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "48.4.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

```shell
│ Warning: Helm release "prometheus" was created but has a failed status. Use the `helm` command to investigate the error, correct it, then run Terraform again.
│ 
│   with helm_release.kube-prometheus,
│   on monitoring.tf line 1, in resource "helm_release" "kube-prometheus":
│    1: resource "helm_release" "kube-prometheus" {
│ 
╵
╷
│ Error: failed post-install: 1 error occurred:
│       * timed out waiting for the condition
│ 
│ 
│ 
│   with helm_release.kube-prometheus,
│   on monitoring.tf line 1, in resource "helm_release" "kube-prometheus":
│    1: resource "helm_release" "kube-prometheus" {
│ 
╵
Releasing state lock. This may take a few moments...



$ kubectl get pods -n=monitoring
NAME                                                     READY   STATUS    RESTARTS   AGE
alertmanager-prometheus-kube-prometheus-alertmanager-0   2/2     Running   0          71s
prometheus-grafana-7886dd7b76-2664b                      3/3     Running   0          73s
prometheus-kube-prometheus-admission-patch-vngr4         0/1     Pending   0          44s
prometheus-kube-prometheus-operator-58fb95695d-6mmwk     1/1     Running   0          73s
prometheus-kube-state-metrics-7f4f499cb5-kmvkg           1/1     Running   0          73s
prometheus-prometheus-kube-prometheus-prometheus-0       2/2     Running   0          71s
prometheus-prometheus-node-exporter-j4qhg                1/1     Running   0          73s
prometheus-prometheus-node-exporter-n5b5r                1/1     Running   0          73s
```
- `prometheus-kube-prometheus-admission-patch` `Pending`

```shell

$ kubectl describe pod prometheus-kube-prometheus-admission-patch-vngr4 -n=monitoring
...

  Type     Reason            Age   From               Message
  ----     ------            ----  ----               -------
  Warning  FailedScheduling  86s   default-scheduler  0/2 nodes are available: 2 Too many pods. preemption: 0/2 nodes are available: 2 No preemption victims found for incoming pod..
```